<?php 
//1. С помощью цикла while вывести все числа в промежутке от 0 до 100, которые делятся на 3 без остатка.
$i = 0;
function ostatok($i){
  while ($i <= 100 ) {
    $i++ ;
    if($i%3===0){
        echo $i++ . PHP_EOL;
   }
} 
}
   
/*2. С помощью цикла do…while написать функцию для вывода чисел от 0 до 10, чтобы результат выглядел так:
0 – ноль.
1 – нечетное число.
2 – четное число.
3 – нечетное число.
…
10 – четное число.*/
function chetno($i){

  do {
    if($i%2===0 && $i>0){
      echo $i . ' - четное ';
    }elseif($i%2===1){
      echo $i . ' - нечетное ';
    }else echo $i . ' - ноль ';
    $i++;
  } while ($i<11);
}
/*3. Объявить массив, в котором в качестве ключей будут использоваться названия областей, 
а в качестве значений – массивы с названиями городов из соответствующей области. Вывести в цикле значения массива, чтобы результат был таким:
Московская область:
Москва, Зеленоград, Клин
Ленинградская область:
Санкт-Петербург, Всеволожск, Павловск, Кронштадт
Рязанская область … (названия городов можно найти на maps.yandex.ru)*/


$spb =array( "Ленинградская область"  =>  array(
  "Всеволожский район" => array( "Всеволожск" => "Всеволожский проспект", 
  "Солнечное" => "улица Вокзальная",
  "Сертолово" => "улица мира",
  "Куйвози"=>"Почтовая улица")));
 
function gorodki($spb){
  
  foreach ($spb as $oblast => $value)
  {
    echo "$oblast:";
        foreach ($value as $raion => $item)
          {
            echo "<br>$raion:"; //если поставить второй аргумент 'item' то будет просто 'array' вместо значения тк район только один
                foreach ($item as $gorod => $ulica)
              {
                echo "<br>$gorod , $ulica";
              }
          }
  }
}


/*4. Объявить массив, индексами которого являются буквы русского языка, 
а значениями – соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’, ‘ю’ => ‘yu’, ‘я’ => ‘ya’).
Написать функцию транслитерации строк.*/
function translit($value)
{
$alfavit =array( "а"  => "a","б" => "b", "в" => "v","г" => "g","д"  => "d","е" => "e", "ё" => "jo","ж" => "zh","з"  => "z","и" => "i", "й" => "j", "к" => "k","л" => "l","м"  => "m",
  "н" => "n", "о" => "o","п" => "p","р"  => "r","с" => "s", "т" => "t","у" => "u","ф"  => "f","х" => "h", "ц" => "c","ч" => "ch","ш"  => "sh","щ" => "shh", "ъ" => "#","ы" => "y",
  "ь" => "'","э"  => "je","ю" => "ju","я" => "ja");
  
  $value = strtr($value, $alfavit);
	return $value;
}

/*5. Написать функцию, которая заменяет в строке пробелы на подчеркивания и возвращает видоизмененную строчку.*/
function probel($phrase,$newphrase){

  $phrase  = "You should eat fruits, vegetables, and fiber every day.";

  $newphrase = str_replace(' ', '_', $phrase);
 return $newphrase;
}
/*6. В имеющемся шаблоне сайта заменить статичное меню (ul – li) на генерируемое через PHP. 
Необходимо представить пункты меню как элементы массива и вывести их циклом. Подумать, как можно реализовать меню с вложенными подменю? Попробовать его реализовать.
*/
//Выполнено ниже

/*7. *Вывести с помощью цикла for числа от 0 до 9, не используя тело цикла. Выглядеть должно так:
for (…){ // здесь пусто}*/
function beztela($g){
  
  for ($g = 0;$g<10;print $g,$g++) ;//использовал print вместо echo тк нужно возвратить только 1 аргумент
}

/*8. *Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».*/
function reg_gorod($spb){
  
  foreach ($spb as $oblast => $value)
  {
    
        foreach ($value as $raion => $item)
          {
            
                foreach ($item as $gorod => $ulica)
              {
                if (preg_match("/К/i", $gorod)) {
                  echo $gorod;
                } 
              }
          }
  }
}

/*9. *Объединить две ранее написанные функции в одну, которая получает строку на русском языке, 
производит транслитерацию и замену пробелов на подчеркивания (аналогичная задача решается при конструировании url-адресов на основе названия статьи в блогах).*/
  
function piska($value)
{
$alfavit =array( "а"  => "a","б" => "b", "в" => "v","г" => "g","д"  => "d","е" => "e", "ё" => "jo","ж" => "zh","з"  => "z","и" => "i", "й" => "j", "к" => "k","л" => "l","м"  => "m",
  "н" => "n", "о" => "o","п" => "p","р"  => "r","с" => "s", "т" => "t","у" => "u","ф"  => "f","х" => "h", "ц" => "c","ч" => "ch","ш"  => "sh","щ" => "shh", "ъ" => "#","ы" => "y",
  "ь" => "'","э"  => "je","ю" => "ju","я" => "ja");
  $value = str_replace(' ', '_', $value);
  $value = strtr($value, $alfavit);
	return $value;
}
 
?>

<html>
  <head>
    <title>Welcome to gb.com!</title>
  </head>
  <body>
    <h1>Success! The gb.com virtual host is working!</h1>
    <ul>
      <li><?php ostatok($i);?></li>
      <li><?php chetno($i);?></li>
      <li><?php gorodki($spb);?></li>
      <li><?php echo translit('гикбрэйнс,вконтакте,мэйл.ру');?></li>
      <li><?php echo probel($phrase,$newphrase);?></li>
      <li>
        <ul><?php 
            $item = array(1=>todo,2=>todo,3=>todo,4=>todo,5=>todo,);
                foreach ($item as $key => $value)
                {
                  echo "<li> $value</li>";
                }
        ?>
        </ul>
      </li>
      <li><?php beztela($g);?></li>
      <li><?php reg_gorod($spb);?></li>
      <li><?php echo piska('привет меня зовут евгений');?></li>
    </ul>
  </body>
</html>

<style>
  h1 {
      display: flex;
      justify-content:center
  }

  .podval{
        margin:bottom;
        display: flex;
        justify-content:center;
      }
  ul{list-style-type: decimal;}
</style>