<?php

namespace App\Models;


class News {
   private static $news = [
        [
            'id'=>1,
            'news'=> [
                [
                       "id" =>1, 
                       "title" =>"Спортивная новость",
                       "disc" => "Описание новости" ,
                ],
               [
                       "id" =>2, 
                       "title" =>"Спортивная новость",
                       "disc" => "Описание новости",
            ],
               [
                       "id" =>3, 
                       "title" =>"Спортивная новость",
                       "disc" => "Описание новости",
               ],
               [
                   "id" =>4, 
                   "title" =>"Спортивная новость",
                   "disc" => "Описание новости",
               ],
                [
                   "id" =>5, 
                   "title" =>"Спортивная новость",
                   "disc" => "Описание новости",
                ],
            ],
        ],
        [
            'id'=>2,
            'news'=> [
               [
                       "id" =>1, 
                       "title" =>"Экономическая новость",
                       "disc" => "Описание новости" ,
               ],
               [
                       "id" =>2, 
                       "title" =>"Экономическая новость",
                       "disc" => "Описание новости",
               ],
               [
                       "id" =>3, 
                       "title" =>"Экономическая новость",
                       "disc" => "Описание новости",
               ],
               [
                   "id" =>4, 
                   "title" =>"Экономическая новость",
                   "disc" => "Описание новости",
               ],
                [
                   "id" =>5, 
                   "title" =>"Экономическая новость",
                   "disc" => "Описание новости",
                ],
            ],
        ],
        [
            'id'=>3,
            'news'=> [
               [ 
                       "id" =>1, 
                       "title" =>" Политическая новость",
                       "disc" => "Описание новости" ,
               ],
               [
                       "id" =>2, 
                       "title" =>" Политическая новость",
                       "disc" => "Описание новости",
               ],
               [
                       "id" =>3, 
                       "title" =>" Политическая новость",
                       "disc" => "Описание новости",
               ],
               [
                   "id" =>4, 
                   "title" =>" Политическая новость",
                   "disc" => "Описание новости",
               ],
                [
                   "id" =>5, 
                   "title" =>" Политическая новость",
                   "disc" => "Описание новости",
                ],
            ],
        ],
        [
            'id'=>4,
            'news'=> [
                [
                       "id" =>1, 
                       "title" =>" Автомобильная новость",
                       "disc" => "Описание новости" ,
                ],
              [
                       "id" =>2, 
                       "title" =>"Автомобильная новость",
                       "disc" => "Описание новости",
              ],
               [
                       "id" =>3, 
                       "title" =>" Автомобильная новость",
                       "disc" => "Описание новости",
               ],
               [ 
                   "id" =>4, 
                   "title" =>" Автомобильная новость",
                   "disc" => "Описание новости",
               ],
                [
                   "id" =>5, 
                   "title" =>" Автомобильная новость",
                   "disc" => "Описание новости",
                ],
            ],
        ],
        [
            'id'=>5,
            'news'=> [
                         [
                                "id" =>1, 
                                "title" =>" Научная новость",
                                "disc" => "Описание новости" ,
            ],
                        [
                                "id" =>2, 
                                "title" =>" Научная новость",
                                "disc" => "Описание новости",
        ],
                        [
                                "id" =>3, 
                                "title" =>" Научная новость",
                                "disc" => "Описание новости",
                        ],
                        [
                            "id" =>4, 
                            "title" =>" Научная новость",
                            "disc" => "Описание новости",
                        ],
                         [
                            "id" =>5, 
                            "title" =>" Научная новость",
                            "disc" => "Описание новости",
                         ],
                    ],
            
        ],
                
            ] ;

    public static function getNews():array{
        return static::$news;
    }


    public static function getNewsId($id): ?array{
        foreach (static::getNews() as $news) {
            if($news['id']== $id){
                return $news;
            }
        }
        return null;
    }
}
