<?php

namespace App\Models;


class News {
   private static $news = [
        [
            'id'=>1,
            'news'=> [
                [
                       "id" =>1, 
                       "title" =>"Спортивная новость 1",
                       "disc" => "Описание новости" ,
                ],
               [
                       "id" =>2, 
                       "title" =>"Спортивная новость 2",
                       "disc" => "Описание новости",
            ],
               [
                       "id" =>3, 
                       "title" =>"Спортивная новость 3",
                       "disc" => "Описание новости",
               ],
               [
                   "id" =>4, 
                   "title" =>"Спортивная новость 4",
                   "disc" => "Описание новости",
               ],
                [
                   "id" =>5, 
                   "title" =>"Спортивная новость 5",
                   "disc" => "Описание новости",
                ],
            ],
        ],
        [
            'id'=>2,
            'news'=> [
               [
                       "id" =>6, 
                       "title" =>"Экономическая новость 1",
                       "disc" => "Описание новости" ,
               ],
               [
                       "id" =>7, 
                       "title" =>"Экономическая новость 2",
                       "disc" => "Описание новости",
               ],
               [
                       "id" =>8, 
                       "title" =>"Экономическая новость 3",
                       "disc" => "Описание новости",
               ],
               [
                   "id" =>9, 
                   "title" =>"Экономическая новость 4",
                   "disc" => "Описание новости",
               ],
                [
                   "id" =>10, 
                   "title" =>"Экономическая новость 5",
                   "disc" => "Описание новости",
                ],
            ],
        ],
        [
            'id'=>3,
            'news'=> [
               [ 
                       "id" =>11, 
                       "title" =>" Политическая новость 1",
                       "disc" => "Описание новости" ,
               ],
               [
                       "id" =>12, 
                       "title" =>" Политическая новость 2",
                       "disc" => "Описание новости",
               ],
               [
                       "id" =>13, 
                       "title" =>" Политическая новость 3",
                       "disc" => "Описание новости",
               ],
               [
                   "id" =>14, 
                   "title" =>" Политическая новость 4",
                   "disc" => "Описание новости",
               ],
                [
                   "id" =>15, 
                   "title" =>" Политическая новость 5",
                   "disc" => "Описание новости",
                ],
            ],
        ],
        [
            'id'=>4,
            'news'=> [
                [
                       "id" =>16, 
                       "title" =>" Автомобильная новость 1",
                       "disc" => "Описание новости" ,
                ],
              [
                       "id" =>16, 
                       "title" =>"Автомобильная новость 2",
                       "disc" => "Описание новости",
              ],
               [
                       "id" =>18, 
                       "title" =>" Автомобильная новость 3",
                       "disc" => "Описание новости",
               ],
               [ 
                   "id" =>19, 
                   "title" =>" Автомобильная новость 4",
                   "disc" => "Описание новости",
               ],
                [
                   "id" =>20, 
                   "title" =>" Автомобильная новость 5",
                   "disc" => "Описание новости",
                ],
            ],
        ],
        [
            'id'=>5,
            'news'=> [
                         [
                                "id" =>21, 
                                "title" =>" Научная новость 1",
                                "disc" => "Описание новости" ,
            ],
                        [
                                "id" =>22, 
                                "title" =>" Научная новость 2",
                                "disc" => "Описание новости",
        ],
                        [
                                "id" =>23, 
                                "title" =>" Научная новость 3",
                                "disc" => "Описание новости",
                        ],
                        [
                            "id" =>24, 
                            "title" =>" Научная новость 4",
                            "disc" => "Описание новости",
                        ],
                         [
                            "id" =>25, 
                            "title" =>" Научная новость 5",
                            "disc" => "Описание новости",
                         ],
                    ],
            
        ],
                
            ] ;

           
    public static function getNews():array{
        return static::$news;
        
    }


    public static function getNewsId($id): ?array{
        foreach (static::getNews() as $news) {
            
            if($news['id']== $id){
                return $news;
                
            }
        }
        return null;
    }
  


    public static function getNewsOneId($id): ?array{
        foreach (static::getNews() as $news) {
            foreach ($news['news'] as $value){
                if($value['id']== $id){
                    return $value;
                    
                }
            }
            }
            
        return null;
    }
}
